---
kind: type
id: T:Autodesk.Revit.DB.MEPModel
source: html/dd78bce5-2ed6-ed3c-f329-1663bf08afa6.htm
---
# Autodesk.Revit.DB.MEPModel

Supports all MEP models that are persistent within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class MEPModel : APIObject
```